Catalogs/СтраницыЭлементовЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтраницыЭлементовЭлектронныхКурсов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭлектронныеТесты</xr:Item>
				<xr:Item>Catalog.ТеорияЭлектронныхКурсов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЭлементКурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТестовыеВопросы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесВопроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапуска</Name>
					<Comment>Item / parameters</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтраницыЭлементовЭлектронныхКурсов/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьСтраницу(ТеорияИлиТест, ЭлементСтраницы, ГруппаСтраниц, КонтекстРедактирования, ВесВопроса = 1) Экспорт
	
	ЭлементПодборкиОбъект = Справочники.СтраницыЭлементовЭлектронныхКурсов.СоздатьЭлемент();
		                                    
	ЭлементПодборкиОбъект.Наименование         = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСтраницы, "Наименование");
	ЭлементПодборкиОбъект.Владелец             = ТеорияИлиТест;
	ЭлементПодборкиОбъект.СсылкаНаЭлементКурса = ЭлементСтраницы; 
	ЭлементПодборкиОбъект.ВесВопроса           = ВесВопроса;
	
	Если ЗначениеЗаполнено(ГруппаСтраниц) Тогда
		
		ДанныеГруппыЭлементаПодборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаСтраниц, "ЭтоГруппа, Родитель");
		
		Если ДанныеГруппыЭлементаПодборки.ЭтоГруппа Тогда
			ЭлементПодборкиОбъект.Родитель = ГруппаСтраниц;
		Иначе
			ЭлементПодборкиОбъект.Родитель = ДанныеГруппыЭлементаПодборки.Родитель;
		КонецЕсли;
		
	КонецЕсли;
	
	РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ЭлементПодборкиОбъект);
	
	ЭлементПодборкиОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
	ЭлементПодборкиОбъект.Записать();
	
	Возврат ЭлементПодборкиОбъект.Ссылка;	
	
КонецФункции

Функция ЭлементЕдинственнойСтраницы(ТеорияИлиТест) Экспорт
	
	ЕдинственныйЭлемент = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыЭлементов.СсылкаНаЭлементКурса КАК СсылкаНаЭлементКурса
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементов
		|ГДЕ
		|	СтраницыЭлементов.ПометкаУдаления = ЛОЖЬ
		|	И СтраницыЭлементов.Владелец = &ПодборкаЭлементов
		|	И СтраницыЭлементов.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПодборкаЭлементов", ТеорияИлиТест);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда			
			ВыборкаДетальныеЗаписи.Следующий();	
			ЕдинственныйЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаЭлементКурса;
		КонецЕсли;

	КонецЕсли;
	
	Возврат ЕдинственныйЭлемент;	
		
КонецФункции

Процедура Перезаписать(ЭлементПодборки, ВесВопроса = Неопределено) Экспорт

	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.СтраницыЭлементовЭлектронныхКурсов");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ЭлементПодборки);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();	
		
		ОбъектЭлементПодборки =  ЭлементПодборки.ПолучитьОбъект();
		
		Если ВесВопроса <> Неопределено Тогда
			ОбъектЭлементПодборки.ВесВопроса = ВесВопроса;
		КонецЕсли;
		
		// Наименование будет обновлено в обработчике ПередЗаписью модуля объекта
		ОбъектЭлементПодборки.Записать();		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
			
КонецПроцедуры

// Позволяет получить таблицу групп элементов верхнего уровня подборки.
//
Функция СтраницыВладельца(Владелец) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтраницыЭлементовЭлектронныхКурсов.Ссылка,
	|	СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа,
	|	СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса,
	|	СтраницыЭлементовЭлектронныхКурсов.Наименование
	|ИЗ
	|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
	|ГДЕ
	|	СтраницыЭлементовЭлектронныхКурсов.Владелец = &Владелец
	|	И СтраницыЭлементовЭлектронныхКурсов.Родитель = &Родитель
	|	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = &ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтраницыЭлементовЭлектронныхКурсов.Код");
	
	
	Запрос.УстановитьПараметр("Владелец", Владелец); 
	Запрос.УстановитьПараметр("Родитель", Справочники.СтраницыЭлементовЭлектронныхКурсов.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь); 
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

// Позволяет получить все элементы группы и все элементы вложенных подгрупп.
// Ссылки на сами группы не выводит, только элементы.
//
// Параметры
//  Группа - Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//
// Возвращаемое значение:
//   Таблица - содержит ссылки на найденные элементы заданной группы.
//
Функция ВсеЭлементы(Подборка, Группа = Неопределено, ТипЭлемента = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтраницыЭлементовЭлектронныхКурсов.Ссылка КАК Ссылка,
	               |	СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса КАК СсылкаНаЭлементКурса,
	               |	СтраницыЭлементовЭлектронныхКурсов.ВесВопроса КАК ВесВопроса,
	               |	СтраницыЭлементовЭлектронныхКурсов.Родитель КАК Родитель,
	               |	СтраницыЭлементовЭлектронныхКурсов.ПараметрыЗапуска КАК ПараметрыЗапуска
	               |ИЗ
	               |	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
	               |ГДЕ
	               |	СтраницыЭлементовЭлектронныхКурсов.Владелец = &Подборка
	               |	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ
	               |	И СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Подборка", Подборка);
	
	Если ЗначениеЗаполнено(Группа) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И	СтраницыЭлементовЭлектронныхКурсов.Родитель В ИЕРАРХИИ(&Группа)";
		
		Запрос.УстановитьПараметр("Группа", Группа);
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТипЭлемента) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		| И	ТИПЗНАЧЕНИЯ(СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса) = &ТипЭлемента";
		
		Запрос.УстановитьПараметр("ТипЭлемента", ТипЭлемента);
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция НайтиПоСсылкеНаЭлемент(СсылкаНаЭлемент, Подборка = Неопределено, ПометкаУдаления = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыЭлементовЭлектронныхКурсов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
		|ГДЕ
		|	&ОтборПоВладельцу
		|	И СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса = &СсылкаНаЭлементКурса
		|	И СтраницыЭлементовЭлектронныхКурсов.ЭтоГруппа = ЛОЖЬ
		|	И &ОтборПоПометкеУдаления";
	
	Запрос.УстановитьПараметр("СсылкаНаЭлементКурса", СсылкаНаЭлемент);
	
	Если ПометкаУдаления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПометкеУдаления", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоПометкеУдаления", "СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = &ПометкаУдаления");
		Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	КонецЕсли;	
	
	Если Подборка = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВладельцу", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВладельцу", "СтраницыЭлементовЭлектронныхКурсов.Владелец = &Подборка");
		Запрос.УстановитьПараметр("Подборка", Подборка);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Страница = Неопределено;
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
		ВыборкаДетальныеЗаписи.Следующий();
		Страница = ВыборкаДетальныеЗаписи.Ссылка;						
	КонецЕсли;
	
	Возврат Страница;
	
КонецФункции

Функция ВесаВопросов(Тест) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраницыЭлементовЭлектронныхКурсов.СсылкаНаЭлементКурса КАК Вопрос,
		|	СтраницыЭлементовЭлектронныхКурсов.ВесВопроса КАК ВесВопроса
		|ИЗ
		|	Справочник.СтраницыЭлементовЭлектронныхКурсов КАК СтраницыЭлементовЭлектронныхКурсов
		|ГДЕ
		|	СтраницыЭлементовЭлектронныхКурсов.Владелец = &Тест
		|	И СтраницыЭлементовЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Тест", Тест);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
